import time
from colorama import Style
import keyboard
print("Натисніть Enter, щоб почати")
keyboard.wait("enter")
time.sleep(2)
print("За видавництвом SkibidiSigma Entertainment...")
time.sleep(2)
print("Стасюк Олександр")
time.sleep(2)
print("Бондаренко Олексій")
time.sleep(2)
print("та Іван Медведський")
time.sleep(2)
print("представляють...")
time.sleep(2)
print("Хіт 2024 року в світі ігор...")
time.sleep(2)
print(f"{Style.BRIGHT}ПІ ДІДДІ В КОНДИЦІЯХ{Style.RESET_ALL}")
time.sleep(2)
print("""
Початок гри.
Історія ведеться від лиця Івана Золо, головного героя.
Натискайте клавішу Enter, щоб грати, читати
діалоги між персонажами та насолоджуватися.
Бажаю приємної гри!

- Стасюк Олександр, співзасновник SkibidiSigma Entertainment""")
keyboard.wait("enter")
print(f"""
{Style.BRIGHT}ГЛАВА І: Зародження зла{Style.RESET_ALL}""")
keyboard.wait("enter")
print("""
Ви знаходитеся в магазині, хочете купити енергетик.
Ви зараз біля каси, викладаєте енергетик на касу.""")
keyboard.wait("enter")
print("""
Касир: З вас 19,50.""")
keyboard.wait("enter")
print("""
*Ви перевіряєте свої кишені, але грошей вам не вистачає*""")
keyboard.wait("enter")
print("""
Ви: Вибачаюсь, але у мене тільки 17 гривень... може,
я занесу 2 гривні та 50 копійок пізніше?""")
keyboard.wait("enter")
print("""
Касир: Вибачаюсь, але у нас так не працює. Ви повинні
покласти товар на те місце, звідки його взяли.""")
keyboard.wait("enter")
print("""
*Ви з відчаєм кладете енергетик на місце, і йдете
з магазину. На щастя, ви знайомі з Литвином, головою компанії 
по виробництву енергетиків. Він відкрив цей бізнес з нагодою
підзаробити грошей, і у нього удалося. Ви йдете до нього додому,
щоб позичити 3 гривні на енергетик*""")
keyboard.wait("enter")
print("""
*Ви прийшли додому до Литвина, але раптом, аж ні звідки...*""")
time.sleep(1)
print("""
Пі Дідді: Здоров, хто ти?""")
time.sleep(1)
print("""
*Ви не знаєте, хто цей мужик, але він був у Литвина вдома*""")
keyboard.wait("enter")
print("""
Ви: Я до Литвина. Він мій давній знайомий і хороший приятель.""")
keyboard.wait("enter")
print("""
Пі Дідді: Чудово! Друг мого друга - і мій друг! Заходь!""")
keyboard.wait("enter")
print("""
*Ви зайшли до хати Литвина*""")
keyboard.wait("enter")
print("""
Литвин: О! Іване, привіт! Скільки років, скільки зим!""")
keyboard.wait("enter")
print("""
Ви: Я теж радий зустрічі!""")
keyboard.wait("enter")
print("""
Пі Дідді: Пропоную сісти за стіл і випити енергос
за дружбу і за возз'єднання давніх друзів!""")
keyboard.wait("enter")
print("*Ви сідаєте за стіл. Пі Дідді тим часом наливає енергетик*")
keyboard.wait("enter")
print("""
Литвин: До речі, забув дещо розказати. Це мій друг із США. Його звати
Пі Дідді, але ти його можеш називати \"Дідді\".""")
keyboard.wait("enter")
print("""
Пі Дідді: Можу розказати, як ми познайомилися з Литвином:
Я зареєструвався на OLX Роботі, і знайшов у Литвина
вакансію \"Менеджер по продажам\". Я, з радістю, написав
йому в особисті, і я отримав роботу. З тих пір, ми вже
півроку співпрацюємо і стали хорошими партнерами.""")
keyboard.wait("enter")
print("""
Ви: Цікаво. Ну то що, вип'ємо по енергетику?""")
keyboard.wait("enter")
print("""
Литвин і Пі Дідді: Вперед! Будьмо!""")
keyboard.wait("enter")
print("""
*ви випиваєте освіжуючий енергетик Литвина*
Ви: Ого! Як смачно!""")
keyboard.wait("enter")
print("""
Литвин: Щось мені погано...""")
keyboard.wait("enter")
print("""
Ви: Мені теж...""")
keyboard.wait("enter")
print("""
*Ви засинаєте. Це було точно не через втому чи хворобу.
Ви просинаєтеся у погребі разом з Литвином*""")
keyboard.wait("enter")
print("""
Ви: Де це ми?""")
keyboard.wait("enter")
print("""
Литвин: Скоріш за все, ми у погребі. Я точно не знаю,
це не мій дім. Я тобі в Telegram надіслав адресу дому
Дідді.""")
keyboard.wait("enter")
print("""
Ви: Як гадаєш, як звідси вибратися?""")
keyboard.wait("enter")
print("""
Ви: Думаю, тут є якийсь люк, чи ще щось...""")
keyboard.wait("enter")
print("""
*Ви старанно намагаєтеся знайти вихід, і знайшли двері, які були під 
великим кодовим замком. Необхідно підібрати правильну комбінацію цифр,
щоб вийти на волю.*""")
keyboard.wait("enter")
print("""
Ви: Як гадаєш, як на знайти правильну комбінацію?""")
keyboard.wait("enter")
print("""
Литвин: Я не знаю... або, може ми спробуємо...""")
keyboard.wait("enter")
print("""
*Литвин випадково зачіпив вазу і розбив її. Але важливіше те, що
він знайшов баночку зі снодійним*""")
keyboard.wait("enter")
print("""
Ви: Стоп, невже це...""")
keyboard.wait("enter")
print("""
Литвин: На жаль, ти правильно думаєш. Дідді нас усипив, і кинув
нас у погріб. Як я міг не знати, що ж він за \"людина\"...""")
keyboard.wait("enter")
print("""
Ви: Не гаймо часу! Наразі ми маємо вийти з цього погребу, а
потім вже будемо розбиратися...""")
keyboard.wait("enter")
print("""
Литвин: Так, ти правий. Може, є якийсь спосіб знайти
вірну комбінацію цифр для замка?""")
keyboard.wait("enter")
print("""
Ви: Може. Знизу замка, дрібним текстом, написано, що нам
треба знайти листки з цифрами.""")
keyboard.wait("enter")
print("""
Литвин: Він ще гратись хоче... Ну, добре, рушаймо!""")
keyboard.wait("enter")
print("""
Ви: Може десь за цим диваном...""")
keyboard.wait("enter")
print("""
*За диваном, ви знайшли цифру \"4\"*""")
keyboard.wait("enter")
print("""
Ви: Я знайшов четвірку!""")
keyboard.wait("enter")
print("""
Литвин: А я - двійку!""")
keyboard.wait("enter")
print("""
Ви: Залишилось лише 2 цифри...""")
keyboard.wait("enter")
print("""
Литвин: Але тут вже порожньо!""")
keyboard.wait("enter")
print("""
*Потім, ви берете свій погляд на сталеві балки на стіні,
розставлені у виді перевернутої грецької літери \"Σ\"
(сігма)*""")
keyboard.wait("enter")
print("""
Литвин: Або ж... ця фігура на стіні... вона виглядає як
цифра \"3\"!""")
keyboard.wait("enter")
print("""
Ви: І все! Немає вже місць, де можуть переховуватися ці цифри!
Куди ж ми второпали?!""")
keyboard.wait("enter")
print("""
*Ви в гніві розбиваєте банку зі снодійним. На банці була
цифра \"1\".*""")
keyboard.wait("enter")
print("""
Ви: НАРЕШТІ! МИ ЗНАЙШЛИ ОСТАННЮ ЦИФРУ! ЦЕ - ОДИНИЦЯ!""")
keyboard.wait("enter")
print("""
Литвин: Але ще треба сполучити цифри у правильну комбінацію...
Спробуймо найбанальніший варіант...""")
keyboard.wait("enter")
print("""
*Литвин вводить ці цифри, і замок відпав*""")
keyboard.wait("enter")
print("""
Ви: Серйозно?! Хто взагалі ставить таку банальщину як пароль?!""")
keyboard.wait("enter")
print("""
*Литвин відчиняє двері, а там...*""")
keyboard.wait("enter")
print("""
Литвин: Ні... цього... н-не може б-бути...""")
keyboard.wait("enter")
print("""
Ви: Що трапилося?""")
keyboard.wait("enter")
print("""
*Ви підходите до дверей, а там...
...десятки банок з-під дитячої олії*""")
keyboard.wait("enter")
print("""
Ви: Литвине, є розмова...""")
keyboard.wait("enter")
print("""
Литвин: Добре, кажи, а то мені треба \"відійти\" від побаченого...""")
keyboard.wait("enter")
print("""
Ви: ЩО ЗА ПРИДУРКІВ ТИ СОБІ НАЙМАЄШ?! НЕВЖЕ ТИ НАСТІЛЬКИ
НАЇВНИЙ ЗАТУПОК ЩО ДОВІРЯЄШ КОМУ ПОПАЛО?!""")
keyboard.wait("enter")
print("""
Литвин: Більше такого не буде, обіцяю.""")
keyboard.wait("enter")
print("""
Ви: Уже й так передали куті меду... але зараз, треба вибратися
звідси...""")
keyboard.wait("enter")
print("""
*Великі двері відчинилися ззаду. То був не погріб, а гараж*""")
keyboard.wait("enter")
print("""
Литвин: Ну що ж, радий, що ми вибралися. Бувай!""")
keyboard.wait("enter")
print("""
Ви: Бувай! Більше, щоб такого не було! Дивись мені!""")
keyboard.wait("enter")
print("""
*Ви розійшлися по домам. Ви відчиняєте двері, лягаєте
на свій комфортний диван, аж раптом у вас задзвенів
телефон. То був Литвин...*""")
keyboard.wait("enter")
print("""
Ви: Ало?""")
keyboard.wait("enter")
print("""
Литвин: Іване, ти повинен це побачити...""")
keyboard.wait("enter")
print(f"""
{Style.BRIGHT}ГЛАВА ІІ: Загострення{Style.RESET_ALL}""")
keyboard.wait("enter")
print("""
Литвин: Ніяких пояснень, просто прийди за цією
адресою: вул. Обоюдного, 52""")
keyboard.wait("enter")
print("""
*Ви відправляєтеся на цю адресу. Дім Литвина, виявляється,
знаходився на іншому кінці міста Сігмабург*

Ви: Капець, йти цілу годину! Або ж...""")
keyboard.wait("enter")
print("""
*Ви замовляєте таксі. До вас приїжджає таксі комфорт-класу*
Таксист: Ми до вулиці Обоюдного?*

Ви: Так. Мене там друг чекає.""")
keyboard.wait("enter")
print("""
*Ви доїхали до Литвина*""")
keyboard.wait("enter")
print("""
Ви: Литвине! Я прийшов!""")
keyboard.wait("enter")
print("""
Литвин: Молодець! А тепер, хутко до хати!""")
keyboard.wait("enter")
print("""
*Ви зайшли до хати. Там все було потрощене, все в пилюці,
скло побите, але раптом...*""")
keyboard.wait("enter")
print("""
Ви: Гей, Литвине! Я знайшов якийсь папірець!""")
keyboard.wait("enter")
print("""
Литвин: Гайда прочитаємо!""")
keyboard.wait("enter")
print(f"""
*В записці:*
\"Ну привіт, Литвинчику! Ти не захотів йти нам на зустріч,
не передавши {Style.BRIGHT}рецепт{Style.RESET_ALL} нашому {Style.BRIGHT}босу{Style.RESET_ALL}. Тепер ти заплатиш за
це ой, яку велику ціну! Бажаю успіхів хоч пальцем
чіпнути нашого {Style.BRIGHT}боса.{Style.RESET_ALL} Ми домоглися того, що ми нарешті
знайшли твій рецепт. Тепер нас не зупинити! Шукай
нас в лісі, якщо ще виживеш там!
З (( повагою )), Віктор Коренеплід\"""")
keyboard.wait("enter")
print(f"""
Ви: Віктор... Коренеплід? Хто це взагалі?""")
keyboard.wait("enter")
print(f"""
Литвин: Гадки не маю...""")
keyboard.wait("enter")
print(f"""
Ви: В лісі, наскільки я знаю, прихований один будинок. Там
раніше жили люди, але, на жаль, вовки всіх їх
перегризли, і в домі зараз одна пилюка і сміття.""")
keyboard.wait("enter")
print(f"""
Литвин: То нащо ми тут стоїмо?! Хутчіш, мчимо туди!""")
keyboard.wait("enter")
print(f"""
*ви доїхали до лісу в передмісті Сігмабургу*
Ви: Це десь має бути тут...""")
keyboard.wait("enter")
print(f"""
Литвин: Не знаю... дім виглядає досить... занедбаним?""")
keyboard.wait("enter")
print(f"""
Ви: Давай спробуємо обшукати його. Може там є
якась цінна інформація про цього Віктора Коренеплода.""")
keyboard.wait("enter")
print(f"""
*Ви зайшли в дім. Ви ледве не задихнулись від різкого
запаху пилюки*""")
keyboard.wait("enter")
print(f"""
Ви: *кашляє* Литвине, рекомендую прикрити рота чимось!""")
keyboard.wait("enter")
print(f"""
*Литвин прикриває рот коміром його кофти*

Литвин: Що ж, тут нікого й нема! Можемо виходити!""")
keyboard.wait("enter")
print(f"""
*Литвин смикає за дверну ручку, але двері не піддавалися.
Також, було чутне тікання годинника, яке ставало все більш
інтенсивним*""")
keyboard.wait("enter")
print(f"""
Ви: ЛИТВИНЕ! ТІКАЙМО! ТУТ ЗАКЛАДЕНА БОМБА!""")
keyboard.wait("enter")
print(f"""
*Литвин взяв велику деревну колоду і почав таранити двері*""")
keyboard.wait("enter")
print(f"""
Ви: О! Вже чутно тріскіт дерева! МИ МАЙЖЕ НА СВОБОДІ!""")
keyboard.wait("enter")
print(f"""
*Литвин все-ж протаранив двері*""")
keyboard.wait("enter")
print(f"""
Ви: ВИХОДИМО!""")
keyboard.wait("enter")
print("""
*Ви вийшли. Коли ви вийшли, дім моментально затопило...
...молоком?*

Ви: Молоко? Серйозно?

Литвин: Головне, що ми в ньому не захлебнулися!""")
keyboard.wait("enter")
print("""
Ви: О, а ще, я знайшов ще одну записку!""")
keyboard.wait("enter")
print(f"""
{Style.BRIGHT}ГЛАВА ІІІ - Занепад{Style.RESET_ALL}""")
keyboard.wait("enter")
print("""
Тим часом, десь в сховку деяких людей:
???: *злісно кричить* Коренеплід!! Як ти міг їх відпустити! Ти сказав, що
двері міцні як танк!

Коренеплід: Вибачаюсь, моя провина.

???: Тут простого \"вибач\" недостатньо, порівняно з
тим, що ти накоїв після проваленої операції \"Творожок\"!

Коренеплід: Я не знаю, що сказати... може, ми
якось домовимось?

???: Домовитись? Ти зараз серйозно? Ні-ні-ні! Ми поступимо
іншим шляхом, а саме - виженемо тебе.

Коренеплід: Що-що?! Це якась нісенітниця!

???: Ти ще досі не зрозумів?! Ти тепер - ніхто! І звати тепер
тебе - ніяк! Ми стільки фінансових збитків отримали, на стільки
сильно влізли у борги, що навіть твої мама з паханом не
заробляють стільки, скільки ми витратили на ловлю цих двох!
Тепер, ми тебе виганяємо і ти тепер не з нами! НОСА ДОГОРИ 
І НА ВСІ ЧОТИРИ СТОРОНИ, ЩОБ І ДУМКИ ПРО ТЕБЕ ТУТ НЕ БУЛО!!!
ЯКБИ Ж ТИ ЗНАВ, ЩО З ТОБОЮ ЗРОБИТЬ НАШ БОС, ВІД ТЕБЕ І СЛІДУ
ТУТ НЕ БУЛО! ЗАБИРАЙСЯ ЗВІДСИ, НЕДОУМОК!""")
keyboard.wait("enter")
print("""
Тим часом, повертаймося до Литвина та Івана:

Ви: А ні, забудь, просто шмат паперу...""")
keyboard.wait("enter")
print("""
Литвин: Ну капець! То нащо ми сюди йшли!""")
keyboard.wait("enter")
print("""
*Раптом, з лісу виходить якийсь чоловік, весь в
шрамах, в порваному одязі*""")
keyboard.wait("enter")
print("""
Ви: Здоров! Хто ти?

Чоловік з лісу: Якщо я назву своє ім'я, ви не будете
на мене злитися?""")
keyboard.wait("enter")
print("""
Ви: Що за нісенітниці? Звісно ні!""")
keyboard.wait("enter")
print("""
Чоловік з лісу: Мене звати Віктор. Віктор Коренеплід.""")
keyboard.wait("enter")
print("""
Ви: То це ти був весь час? Розказуй, які твої наміри? Чого
ти від нас хочеш?""")
keyboard.wait("enter")
print("""
Коренеплід: Йой-йой-йой! Спинися, парубче! Я вже давно
не з (( ними ))! Мене вигнали за провалену операцію по
затоплення будинку і зробили ізгоєм.""")
keyboard.wait("enter")
print("""
Ви: Але... як ти тут опинився так швидко!?""")
keyboard.wait("enter")
print("""
Коренеплід: Я не знаю. Я просто пройшов до дверей, і мене 
викинуло в ліс згори донизу.""")
keyboard.wait("enter")
print("""
Литвин: *пошепки* Слухай, може це просто якийсь п'яний дід
вийшов з підворотні? Хоча, алкаші тут точно не водяться...""")
keyboard.wait("enter")
print("""
Ви: На кого тоді ти працював?""")
keyboard.wait("enter")
print("""
Коренеплід: Не можу сказати. (( Вони )) все чують...""")
keyboard.wait("enter")
print("""
Ви: Тоді напиши пальцем по землі його ім'я та місце розташування!""")
keyboard.wait("enter")
print("""
*Віктор Коренеплід написав на землі наступне:

Афольд
Верховний командир
*координати бази*""")
keyboard.wait("enter")
print("""
Ви: Афольд, так? Литвине, можеш знайти точку бази по координатах?

Литвин: Звісно! Секунду... є! Прямуймо за маршрутом!

Ви: О, і ще, Вікторе, прямо, ліворуч і праворуч 2 рази. Так ви
виберетеся з лісу.

Коренеплід: Дуже вдячний! Бувайте, парубки!""")
keyboard.wait("enter")
print("""
Тим часом, в базі Афольда:
Афольд: Добридень, сер! Командир Гілтер Афольд Алоїсович на місці!

Невідомий: Чудово. До речі, в нашому списку працівників зник 
Віктор Коренеплід. Часом не знаєш чому?

Афольд: Він був звільнений мною в результаті неякісного виконання
обов'язків, сер!

Невідомий: Це, звісно, дуже велика та ризикована втрата для нашої 
команди, але я можу подякувати вам за такий сміливий хід. Я виплачую
вам премію в 30 тисяч гривень за якісне виконання обов'язків верховного
командира.

Афольд: Не треба. Ми й так вже по вуха в боргах.

Невідомий: Я відкладав ці гроші, щоб виплатити премію найкращому
моєму працівнику. Ось твої гроші.

Афольд: *бере гроші* Велике спасибі!""")
keyboard.wait("enter")
print("""
Повертаймося до Литвина та Івана:
Ви: До речі, а що то за рецепт, проо який Коренеплід говорив у записці,
що лежала в тебе вдома?""")
keyboard.wait("enter")
print("""
Литвин: Це рецепт ексклюзивного енергетика, що містить кондиції. Це
річ, що надає тобі силу міжгалактичного рівня! Якщо він опиниться
не в тих руках, світ порине в хаос!""")
keyboard.wait("enter")
print("""
Ви: Я тебе розумію. То що ж, ми прийшли.

*Ви з Литвином прийшли до якоїсь полум'яної цитаделі*

Ви: То що, заходимо?

Литвин: Заходимо!""")
keyboard.wait("enter")
print("""
Тим часом, в цитаделі:

Афольд: Сер! До нас пробралися двоє незнайомців!

Невідомий: Як це? Вони пройшли крізь систему?! ЦЕ НЕМОЖЛИВО!
Афольде, чого ти стоїш!? Хутчіш до 1-го поверху!""")
keyboard.wait("enter")
print("""
*Згодом, Ви з Литвином зустрічаєте Афольда*

Афольд: ВСІМ СТОЯТИ! РУКИ ВГОРУ! НІ КРОКУ З МІСЦЯ!

Ви: Хто ти взагалі такий?!

Афольд: Я той, кого ти не мав знати, проте ти все-ж зміг
дібратися аж сюди. Похвалю.""")
keyboard.wait("enter")
print("""
*Литвин вирубує Афольда ударом ногою в голову*

Ви: Ай Литвин, ну ти на кондиціях роздаєш! Ай, тигр!""")
keyboard.wait("enter")
print("""
Литвин: Дякую! А цю зброю в Афольда ми забираємо.

*Литвин підібрав кулемет Афольда*""")
keyboard.wait("enter")
print("""
*Ви піднімаєтеся по сходах вгору і вгору*

Невідомий: От дідько! Ну нічого, вони ще не знають, що на них
чекає...""")
keyboard.wait("enter")
print("""
*Ви піднялися на останній поверх, але вас з Литвином тут же
замикають в клітку*

Ви: Що коїться? Хто це зробив?!""")
keyboard.wait("enter")
print("""
Невідомий: Це зробив я. Певен, ти не знаєш, хто я і що я від
вас хочу, та все-ж, мені варто зняти свою маску.""")
keyboard.wait("enter")
print("""
*Невідомий зняв маску. То був шок, бо виявляється, то був...

Ви та Литвин: ПІ ДІДДІ?!

Пі Дідді: Так, то був я. Афольд Алоїсович то мій верховний
генерал, а Віктор Коренеплід - мій особистий помічник.*""")
keyboard.wait("enter")
print("""
Литвин: Але, чого ти добивався весь цей час?! Які твої мотиви?

Пі Дідді: Я постійно заздрив твоєму успіху. Те, як ти розвив
свій бізнес, фактично, з нуля - вразило мене. Проте, я був
затупком, і подався на такі кроки. Я дуже перепрошую.""")
keyboard.wait("enter")
print("""
Литвин: Але, чому ти мені це не сказав раніше? Я б тобі дав
свої поради, я б тобі допоміг розвити твій власний бізнес!

Пі Дідді: На цей раз, клянуся всім, що в мене є, що я більше
ніколи не вдаватимусь до таких дій. То що, мир?

Литвин: Мир!""")
keyboard.wait("enter")
print(f"""
{Style.BRIGHT}КІНЕЦЬ ІСТОРІЇ{Style.RESET_ALL}""")
time.sleep(1)
print("""
Дякую, що зацінили наш проєкт і додивилися до кінця.
Продовження буде в наступній частині \"Пі Дідді в Кондиціях\".
Вас чекатимуть більше пригод Литвина та Івана Золо. Надіємось,
що вам сподобалася ця частина, а також надіємось, що і подальші
2 частини (це буде трилогія) вам теж стануть до вподоби.
Ще раз, велике дякую!
Бувайте!

- SkibidiSigma Entertainment""")

time.sleep(1)
print(f"{Style.BRIGHT}ВІДГУК{Style.RESET_ALL}")
while True:
    chars = ["Іван", "Литвин", "Пі Дідді", "Афольд", "Коренеплід", "Таксист"]
    a = input(f"""
Який ваш улюблений персонаж трилогії?
Список: {chars}""")
    if a not in chars:
        print("Це не персонаж даного проекту.")
    else:
        continue
input("""
Що варто покращити в проекті на вашу думку?""")
print("Дякую за відгук!")