import time
from colorama import Style
import keyboard
print("Натисніть Enter, щоб почати")
keyboard.wait("enter")
time.sleep(2)
print("За видавництвом SkibidiSigma Entertainment...")
time.sleep(2)
print("Стасюк Олександр")
time.sleep(2)
print("Бондаренко Олексій")
time.sleep(2)
print("та Іван Медведський")
time.sleep(2)
print("представляють...")
time.sleep(2)
print("Хіт 2024 року в світі ігор...")
time.sleep(2)
print(f"{Style.BRIGHT}ПІ ДІДДІ В КОНДИЦІЯХ{Style.RESET_ALL}")
time.sleep(2)
print("""
Початок гри.
Історія ведеться від лиця Івана Золо, головного героя.
Натискайте клавішу Enter, щоб грати, читати
діалоги між персонажами та насолоджуватися.
Бажаю приємної гри!

- Стасюк Олександр, співзасновник SkibidiSigma Entertainment""")
keyboard.wait("enter")
print("""
Ви знаходитеся в магазині, хочете купити енергетик.""")
keyboard.wait("enter")
print("""
Ви знаходитеся в магазині, хочете купити енергетик.
Ви зараз біля каси, викладаєте енергетик на касу.""")
keyboard.wait("enter")
print("""
Касир: З вас 19,50.""")
keyboard.wait("enter")
print("""
*Ви перевіряєте свої кишені, але грошей вам не вистачає*""")
keyboard.wait("enter")
print("""
Ви: Вибачаюсь, але у мене тільки 17 гривень... може,
я занесу 2 гривні та 50 копійок пізніше?""")
keyboard.wait("enter")
print("""
Касир: Вибачаюсь, але у нас так не працює. Ви повинні
покласти товар на те місце, звідки його взяли.""")
keyboard.wait("enter")
print("""
*Ви з відчаєм кладете енергетик на місце, і йдете
з магазину. На щастя, ви знайомі з Литвином, головою компанії 
по виробництву енергетиків. Він відкрив цей бізнес з нагодою
підзаробити грошей, і у нього удалося. Ви йдете до нього додому,
щоб позичити 3 гривні на енергетик*""")
keyboard.wait("enter")
print("""
*Ви прийшли додому до Литвина, але раптом, аж ні звідки...*""")
time.sleep(1)
print("""
Пі Дідді: Здоров, хто ти?""")
time.sleep(1)
print("""
*Ви не знаєте, хто цей мужик, але він був у Литвина вдома*""")
keyboard.wait("enter")
print("""
Ви: Я до Литвина. Він мій давній знайомий і хороший приятель.""")
keyboard.wait("enter")
print("""
Пі Дідді: Чудово! Друг мого друга - і мій друг! Заходь!""")
keyboard.wait("enter")
print("""
*Ви зайшли до хати Литвина*""")
keyboard.wait("enter")
print("""
Литвин: О! Іване, привіт! Скільки років, скільки зим!""")
keyboard.wait("enter")
print("""
Ви: Я теж радий зустрічі!""")
keyboard.wait("enter")
print("""
Пі Дідді: Пропоную сісти за стіл і випити енергос
за дружбу і за возз'єднання давніх друзів!""")
keyboard.wait("enter")
print("*Ви сідаєте за стіл. Пі Дідді тим часом наливає енергетик*")
keyboard.wait("enter")
print("""
Литвин: До речі, забув дещо розказати. Це мій друг із США. Його звати
Пі Дідді, але ти його можеш називати \"Дідді\".""")
keyboard.wait("enter")
print("""
Пі Дідді: Можу розказати, як ми познайомилися з Литвином:
Я зареєструвався на OLX Роботі, і знайшов у Литвина
вакансію \"Менеджер по продажам\". Я, з радістю, написав
йому в особисті, і я отримав роботу. З тих пір, ми вже
півроку співпрацюємо і стали хорошими партнерами.""")
keyboard.wait("enter")
print("""
Ви: Цікаво. Ну то що, вип'ємо по енергетику?""")
keyboard.wait("enter")
print("""
Литвин і Пі Дідді: Вперед! Будьмо!""")
keyboard.wait("enter")
print("""
*ви випиваєте освіжуючий енергетик Литвина*
Ви: Ого! Як смачно!""")
keyboard.wait("enter")
print("""
Литвин: Щось мені погано...""")
keyboard.wait("enter")
print("""
Ви: Мені теж...""")
keyboard.wait("enter")
print("""
*Ви засинаєте. Це було точно не через втому чи хворобу.
Ви просинаєтеся у погребі разом з Литвином*""")
keyboard.wait("enter")
print("""
Ви: Де це ми?""")
keyboard.wait("enter")
print("""
Литвин: Скоріш за все, ми у погребі. Я точно не знаю,
це не мій дім. Я тобі в Telegram надіслав адресу дому
Дідді.""")
keyboard.wait("enter")
print("""
Ви: Як гадаєш, як звідси вибратися?""")
keyboard.wait("enter")
print("""
Ви: Думаю, тут є якийсь люк, чи ще щось...""")
keyboard.wait("enter")
print("""
*Ви старанно намагаєтеся знайти вихід, і знайшли двері, які були під 
великим кодовим замком. Необхідно підібрати правильну комбінацію цифр,
щоб вийти на волю.*""")
keyboard.wait("enter")
print("""
Ви: Як гадаєш, як на знайти правильну комбінацію?""")
keyboard.wait("enter")
print("""
Литвин: Я не знаю... або, може ми спробуємо...""")
keyboard.wait("enter")
print("""
*Литвин випадково зачіпив вазу і розбив її. Але важливіше те, що
він знайшов баночку зі снодійним*""")
keyboard.wait("enter")
print("""
Ви: Стоп, невже це...""")
keyboard.wait("enter")
print("""
Литвин: На жаль, ти правильно думаєш. Дідді нас усипив, і кинув
нас у погріб. Як я міг не знати, що ж він за \"людина\"...""")
keyboard.wait("enter")
print("""
Ви: Не гаймо часу! Наразі ми маємо вийти з цього погребу, а
потім вже будемо розбиратися...""")
keyboard.wait("enter")
print("""
Литвин: Так, ти правий. Може, є якийсь спосіб знайти
вірну комбінацію цифр для замка?""")
keyboard.wait("enter")
print("""
Ви: Може. Знизу замка, дрібним текстом, написано, що нам
треба знайти листки з цифрами.""")
keyboard.wait("enter")
print("""
Литвин: Він ще гратись хоче... Ну, добре, рушаймо!""")
keyboard.wait("enter")
print("""
Ви: Може десь за цим диваном...""")
keyboard.wait("enter")
print("""
*За диваном, ви знайшли цифру \"4\"*""")
keyboard.wait("enter")
print("""
Ви: Я знайшов четвірку!""")
keyboard.wait("enter")
print("""
Литвин: А я - двійку!""")
keyboard.wait("enter")
print("""
Ви: Залишилось лише 2 цифри...""")
keyboard.wait("enter")
print("""
Литвин: Але тут вже порожньо!""")
keyboard.wait("enter")
print("""
*Потім, ви берете свій погляд на сталеві балки на стіні,
розставлені у виді перевернутої грецької літери \"Σ\"
(сігма)*""")
keyboard.wait("enter")
print("""
Литвин: Або ж... ця фігура на стіні... вона виглядає як
цифра \"3\"!""")
keyboard.wait("enter")
print("""
Ви: І все! Немає вже місць, де можуть переховуватися ці цифри!
Куди ж ми второпали?!""")
keyboard.wait("enter")
print("""
*Ви в гніві розбиваєте банку зі снодійним. На банці була
цифра \"1\".*""")
keyboard.wait("enter")
print("""
Ви: НАРЕШТІ! МИ ЗНАЙШЛИ ОСТАННЮ ЦИФРУ! ЦЕ - ОДИНИЦЯ!""")
keyboard.wait("enter")
print("""
Литвин: Але ще треба сполучити цифри у правильну комбінацію...
Спробуймо найбанальніший варіант...""")
keyboard.wait("enter")
print("""
*Литвин вводить ці цифри, і замок відпав*""")
keyboard.wait("enter")
print("""
Ви: Серйозно?! Хто взагалі ставить таку банальщину як пароль?!""")
keyboard.wait("enter")
print("""
*Литвин відчиняє двері, а там...*""")
keyboard.wait("enter")
print("""
Литвин: Ні... цього... н-не може б-бути...""")
keyboard.wait("enter")
print("""
Ви: Що трапилося?""")
keyboard.wait("enter")
print("""
*Ви підходите до дверей, а там...
...десятки банок з-під дитячої олії*""")
keyboard.wait("enter")
print("""
Ви: Литвине, є розмова...""")
keyboard.wait("enter")
print("""
Литвин: Добре, кажи, а то мені треба \"відійти\" від побаченого...""")
keyboard.wait("enter")
print("""
Ви: ЩО ЗА ПРИДУРКІВ ТИ СОБІ НАЙМАЄШ?! НЕВЖЕ ТИ НАСТІЛЬКИ
НАЇВНИЙ ЗАТУПОК ЩО ДОВІРЯЄШ КОМУ ПОПАЛО?!""")
keyboard.wait("enter")
print("""
Литвин: Більше такого не буде, обіцяю.""")
keyboard.wait("enter")
print("""
Ви: Уже й так передали куті меду... але зараз, треба вибратися
звідси...""")
keyboard.wait("enter")
print("""
*Великі двері відчинилися ззаду. То був не погріб, а гараж*""")
keyboard.wait("enter")
print("""
Литвин: Ну що ж, радий, що ми вибралися. Бувай!""")
keyboard.wait("enter")
print("""
Ви: Бувай! Більше, щоб такого не було! Дивись мені!""")
keyboard.wait("enter")
print("""
*Ви розійшлися по домам. Ви відчиняєте двері, лягаєте
на свій комфортний диван, аж раптом у вас задзвенів
телефон. То був Литвин...*""")
keyboard.wait("enter")
print("""
Ви: Ало?""")
keyboard.wait("enter")
print("""
Литвин: Іване, ти повинен це побачити...""")
keyboard.wait("enter")
print(f"""
{Style.BRIGHT}КІНЕЦЬ ІСТОРІЇ{Style.RESET_ALL}""")
time.sleep(1)
print("""
Дякую, що зацінили наш проєкт і додивилися до кінця.
Продовження буде в наступній частині \"Пі Дідді в Кондиціях\".
Вас чекатимуть більше пригод Литвина та Івана Золо. Надіємось,
що вам сподобалася ця частина, а також надіємось, що і подальші
2 частини (це буде трилогія) вам теж стануть до вподоби.
Ще раз, велике дякую!
Бувайте!

- SkibidiSigma Entertainment""")